//#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
////
//////int main()
//////{
//////	//第六章
//////	//第一小题
//////	//用筛选法求100之内的素数
//////	
//////	int i, arr[100];
//////
//////	for ( i = 0;  i < 100; i++)
//////	{
//////		arr[i] = i + 1;
//////	}
//////
//////	arr[0] = 0;
//////	for ( i = 0; i < 99; i++)
//////	{
//////		for (int j = i + 1 ; j < 100 ; j++)
//////		{
//////			if (arr[i] != 0 && arr[j] != 0)
//////			{
//////				if (arr[j]%arr[i]==0)
//////				{
//////					arr[j] = 0;
//////				}
//////			}
//////		}
//////	}
//////
//////	printf("筛选法筛选出100以内的素数为：");
//////	for ( i = 0; i < 100; i++)
//////	{
//////		if (arr[i]!=0)
//////		{
//////			printf("%d ", arr[i]);
//////		}
//////	}
//////	return 0;
//////}
////
////
//////int main()
//////{
//////	//第六章
//////	//第二小题
//////	//用选择法对10个整数排序
//////
//////	int i, j, n, arr[10] = {9,6,3,5,2,8,1,4,7,10};
//////
//////	printf("请输入10个数：");
//////	for ( i = 0; i < 10; i++)
//////	{
//////		scanf_s("%d",&arr[i]);
//////	}
//////
//////	for ( i = 0; i < 10 ; i++)
//////	{
//////		for (j = 0; j <10; j++)
//////		{
//////			if (arr[i] > arr[j])
//////			{
//////				n = arr[i];
//////				arr[i] = arr[j];
//////					arr[j] = n;
//////			}
//////		}
//////	}
//////	for ( i = 0; i < 10; i++)
//////	{
//////		printf("%d ", arr[i]);
//////	}
//////	return 0;
//////}
////
//////int main()
//////{
//////	/*第六章
//////	第三小题
//////	求一个三乘三整型矩阵对角线元素之和*/
//////
//////	int i,j,arr[3][3] = {};
//////	int num = 0;
//////	printf("请输入一个3*3的二维数组：\n");
//////	for ( i = 0; i < 3; i++)
//////	{
//////		for ( j = 0; j < 3; j++)
//////		{
//////			scanf_s("%d",&arr[i][j]);
//////		}
//////	}
//////	
//////	for ( i = 0; i < 3; i++)
//////	{
//////		num = num + arr[i][i];
//////	}
//////
//////	printf("%d",num);
//////
//////
//////	return 0;
//////}
////// 
////// 
//////#define n 4
//////int main()
//////{
//////	/*第六章
//////	第四小题
//////	有一个已排好序的数组，要求输入一个数后，按原来排序的规律将他插入数组中*/
//////
//////	int arr[n] ;
//////	int i, j,m;
//////
//////	for ( i = 0; i < n; i++)
//////	{
//////		scanf_s("%d",&arr[i]);
//////	}
//////
//////	for ( i = 0; i < n; i++)
//////	{
//////		for ( j = 0; j < n; j++)
//////		{
//////			if (arr[i] >arr[j])
//////			{
//////				m = arr[i];
//////				arr[i] = arr[j];
//////				arr[j] = m;
//////			}
//////		}
//////	}
//////
//////	printf();
//////	for ( i = 0; i < n; i++)
//////	{
//////		if (arr[i] == 0)
//////		{
//////			scanf_s("%d", arr[i]);
//////		}
//////	}
//////	
//////
//////
//////	for ( i = 0; i < n; i++)
//////	{
//////		printf("%d",arr[i]);
//////	}
//////	
//////	return 0;
//////}
//
//#define n 3
//int main()
//{
//	struct student
//	{
//		int   id;  //学号
//		char name[10];   //名字
//		float chengji[3];  //3科成绩
//		double avg;  //平均成绩
//	}stu[n];
//
//	//输入学生信息
//	int i, j;
//	for ( i = 0; i < n; i++)
//	{
//		//输入id name
//		printf("输入学生学号%d：",i+1);
//		scanf("%d",&stu[i].id);
//		printf("输入学生姓名:");
//		scanf("%s",&stu[i].name);
//		//输入3科成绩
//		for (j = 0; j < 3; j++)
//		{
//			printf("请输入第%d科成绩: ",j+1);
//			scanf("%f",&stu[i].chengji[j]);
//		}
//	}
//
//	//平均总成绩
//	float sumavg,sum,max;
//	double s;
//	max=0;
//	int k;
//	s = 0;
//	for ( i = 0; i < n; i++) //控制人数
//	{
//		sum = 0;
//		for ( j = 0; j < 3; j++) //3科成绩
//		{
//			sum += stu[i].chengji[j];
//		}
//		
//		stu[i].avg = sum / 3.0;  //将每个人的平均成绩赋值给avg
//		sumavg = 0;
//		sumavg = stu[i].avg; //作比较
//		s += stu[i].avg; //每个人的平均成绩总合
//
//		//最高分的学生
//		if (sumavg > max) //判断最高的平均分
//		{
//			max = sumavg;
//			k = i; //记录最高分的学号
//		}
//
//	}
//		s /= n; //求总平均成绩
//	printf("%d名的同学总平均成绩是：%lf \n",n,s);
//	
//	//输出
//	printf("最高分的学生是:%d \n",stu[k].id,stu[k].name);
//	for ( j = 0; j < 3; j++)
//	{
//		printf("该同学的三科成绩是%f：\n",stu[k].chengji[j]);
//	}
//	printf("平均成绩是%lf \n",stu[k].avg);
//	return 0;
//}
//
